// Copyright 2026 Vladislav Aleinik
#include <stdint.h>
#include <stdbool.h>

//==================//
// Структура данных //
//==================//

// Представление типа узла связного списка.
typedef struct Node {
    // Значение, хранящееся в связном списке.
    uint32_t value;

    // Указатель на следующий элемент списка.
    struct Node* next;
    // Указатель на предыдущий элемент списка.
    struct Node* prev;
} Node;

// Представление типа очереди.
typedef struct {
    // Корневой узел кольцевого двусвязного списка.
    //
    // Инвариант структуры данных:
    // - Значение root.value никогда не используется.
    // - Значение root.next равно &root, если очередь пуста,
    //   в противном случае - root.next указывает на первый элемент в очереди.
    // - Значение root.prev равно &root, если очередь пуста,
    //   в противном случае - root.prev указывает на последний элемент в очереди.
    // - У последнего элемента непустого списка указатель next указывает на root.
    // - У первого элемента непустого списка указатель prev указывает на root.
    Node root;
} Queue;

//======================//
// Управление ресурсами //
//======================//

//==================================================================================================
// Функция: queue_init
// Назначение: Инициализирует очередь
//--------------------------------------------------------------------------------------------------
// Параметры:
// queue (in/out) - очередь, которую требуется инициализировать.
//
// Возвращаемое значение:
// Отсутсвует.
//
// Примечания:
// - Для каждой очереди, инициализируемой с помощью queue_init,
//   должна быть вызвана функция queue_free.
//==================================================================================================
void queue_init(Queue* queue);

//==================================================================================================
// Функция: queue_free
// Назначение: Освобождает ресурсы очереди
//--------------------------------------------------------------------------------------------------
// Параметры:
// queue (in/out) - очередь, ресурсы которой требуется освободить.
//
// Возвращаемое значение:
// Отсутсвует.
//==================================================================================================
void queue_free(Queue* queue);

//====================================//
// Доступ к элементам связного списка //
//====================================//

//==================================================================================================
// Функция: queue_add_tail
// Назначение: Записывает новый элемент в хвост очереди.
//--------------------------------------------------------------------------------------------------
// Параметры:
// queue (in/out) - очередь.
// data  (in)     - указатель на память, в которой содержится элемент,
//                  который будет записан в хвост очереди.
//
// Возвращаемое значение:
//  0 - операция выполнена успешно.
// -1 - очередь пуста.
//==================================================================================================
int queue_add_tail(Queue* queue, const uint32_t data);

//==================================================================================================
// Функция: queue_remove_head
// Назначение: Удаляет элемент из головы очереди.
//--------------------------------------------------------------------------------------------------
// Параметры:
// queue (in/out) - очередь.
// data  (out)    - указатель на память, в которую будет записан элемент,
//                  удаляемый из головы очереди.
//
// Возвращаемое значение:
//  0 - операция выполнена успешно.
// -1 - очередь пуста.
//==================================================================================================
int queue_remove_head(Queue* queue, uint32_t* data);

//==================================================================================================
// Функция: queue_empty
// Назначение: Возвращает признак пустоты очереди.
//--------------------------------------------------------------------------------------------------
// Параметры:
// queue (in/out) - очередь.
//
// Возвращаемое значение:
// Признак пустоты очереди.
//==================================================================================================
bool queue_empty(Queue* queue);

//==================================================================================================
// Функция: queue_scale_value
// Назначение: Каждое число X в очереди заменяет на (mul*X + add)
//--------------------------------------------------------------------------------------------------
// Параметры:
// queue (in/out) - очередь.
// mul   (in)     - множитель.
// add   (in)     - слагаемое.
//
// Возвращаемое значение:
// Отсутствует.
//==================================================================================================
void queue_scale_value(Queue* queue, uint32_t mul, uint32_t add);