// Copyright 2024 Vladislav Aleinik
#ifndef HEADER_GUARD_UTILS_H_INCLUDED
#define HEADER_GUARD_UTILS_H_INCLUDED

#include <stdlib.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdbool.h>
#include <math.h>

//=================//
// Удобные функции //
//=================//

//==================================================================================================
// Функция: min
// Назначение: вычисляет минимальное из двух чисел
//--------------------------------------------------------------------------------------------------
// Параметры:
// a (in) - первый аргумент.
// b (in) - второй аргумент.
//
// Возвращаемое значение:
// Меньшее из двух чисел.
//==================================================================================================
inline unsigned min(unsigned a, unsigned b)
{
    return a < b? a : b;
}

// Точность сравнения чисел с плавающей точкой двойной точности
#define DOUBLE_PRECISION 10e-9

//==================================================================================================
// Функция: double_equal
// Назначение: производит сравнение чисел с плавающей точкой с заданной абсолютной погрешностью
//--------------------------------------------------------------------------------------------------
// Параметры:
// el1 (in) - первое число.
// el2 (in) - второе число.
//
// Возвращаемое значение:
// - Флаг равенства чисел в пределах погрешности.
//==================================================================================================
bool double_equal(double el1, double el2)
{
    return fabs(el1 - el2) < DOUBLE_PRECISION;
}

//==================//
// Обработка ошибок //
//==================//

//==================================================================================================
// Функция: verify_contract
// Назначение:
// Производит проверку входных данных. В случае ошибки выводит сообщение об ошибке.
//--------------------------------------------------------------------------------------------------
// Параметры:
// condition (in) - условие, которое требуется проверять.
// format (in) - формат сообщения об ошибке (см. printf).
// ... - дополнительные аргументы, соответствующие формату (см. printf).
//
// Возвращаемое значение:
// отсутствует
//
// Примечания:
// - В случае невыполнения условия функция печатает сообщение об ошибке
//   и завершает выполнение программы.
//==================================================================================================
void verify_contract(bool condition, const char* restrict format, ...)
{
    if (!condition) {
        va_list vargs;
        va_start(vargs, format);
        vprintf(format, vargs);
        va_end(vargs);
        exit(EXIT_FAILURE);
    }
}

// Тип данных, задающий код возврата
typedef enum
{
    // Операция выполнена без ошибок
    RET_OK   = 0,
    // Операция не выполнена, т.к. для её выполнения не хватает памяти
    RET_NOMEM = 1,
    // Операция не выполнена, т.к. аргументы операции некорректны
    RET_INVAL = 2,
    // Операция не выполнена, т.к. операция с файлом вернула ошибку
    RET_FILEIO = 3
} RetCode;

//==================================================================================================
// Функция: retcode_str
// Назначение: Возвращает строку, соответствующую коду ошибки
//--------------------------------------------------------------------------------------------------
// Параметры:
// code (in) - код возврата, которому требуется сопоставить текстовое сообщение.
//
// Возвращаемое значение:
// Строка, соответствующая коду возврата code.
//==================================================================================================
const char* retcode_str(RetCode code)
{
    switch (code)
    {
        case RET_OK:
        {
            return "everything is ok";
        }
        case RET_NOMEM:
        {
            return "not enough memory";
        }
        case RET_INVAL:
        {
            return "invalid argument";
        }
        case RET_FILEIO:
        {
            return "failed file operation";
        }
        default:
        {
            return "invalid return code";
        }
    }
}

//==================================================================================================
// Макрос: STATIC_ASSERT
// Назначение:
// Производит проверку выражения на этапе сборки программы
//--------------------------------------------------------------------------------------------------
// Параметры:
// COND (in) - условие, которое требуется проверять.
// MSG  (in) - идентификатор сообщения об ошибке.
//
// Примечания:
// - В случае невыполнения условия COND будет сгенерирована ошибка сборки.
//==================================================================================================
#define STATIC_ASSERT(COND, MSG) \
    typedef char static_assertion_##MSG[(COND)?1:-1];

//==================================================================================================
// Функция: my_htobe32
// Назначение: Меняет порядок байт в 32-битном беззнаковом числе на Big Endian.
//--------------------------------------------------------------------------------------------------
// Параметры:
// val (in) - число (с естественным порядком байт).
//
// Возвращаемое значение:
// Число с порядком байт Big Endian.
//==================================================================================================
uint32_t my_htobe32(uint32_t val)
{
#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
    // Используем встроенную функцию компилятора.
    return __builtin_bswap32(val);
#else
    return val;
#endif
}

//==================================================================================================
// Функция: my_be32toh
// Назначение: Меняет порядок байт в 32-битном беззнаковом числе с Big Endian.
//--------------------------------------------------------------------------------------------------
// Параметры:
// val (in) - число (с порядком байт Big Endian).
//
// Возвращаемое значение:
// Число с естественным порядком байт.
//==================================================================================================
uint32_t my_be32toh(uint32_t val)
{
    return htobe32(val);
}

//==================================================================================================
// Функция: byteswap32_slow
// Назначение: Неэффективно меняет порядок байт в 32-битном беззнаковом числе.
//--------------------------------------------------------------------------------------------------
// Параметры:
// val (in) - число (с естественным порядком байт).
//
// Возвращаемое значение:
// Число с изменнёным порядком байт.
//
// Примечания:
// - Интересно сравнить бинарный код этой функции и функции htobe32.
//==================================================================================================
uint32_t byteswap32_slow(uint32_t val)
{
    return ((val & 0xFF000000U) >> 24U) | ((val & 0x00FF0000U) >>  8U) |
           ((val & 0x0000FF00U) <<  8U) | ((val & 0x000000FFU) << 24U);
}

#endif // HEADER_GUARD_UTILS_H_INCLUDED
