// Copyright 2024 Vladislav Aleinik
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>

//===================================//
// Макрос для удобной проверки ввода //
//===================================//

#define VERIFY_CONTRACT(contract, format, ...) \
    do {                                       \
        if (!(contract)) {                     \
            printf((format), ##__VA_ARGS__);   \
            exit(EXIT_FAILURE);                \
        }                                      \
    } while (0)

//===========================//
// Функция "проверки" пароля //
//===========================//

const bool VERIFY_PASSWORD = true;
const char* PASSWORD = "Now you see me!";

//==================================================================================================
// Функция: password_is_ok
// Назначение: проверяет пароль на правильность
//--------------------------------------------------------------------------------------------------
// Параметры:
// str (in) - строка с паролем
//
// Возвращаемое значение:
// true - пароль правильный
// false - пароль непраивльный
//
// Используемые внешние переменные:
// отсутствуют
//
// Примечания:
// - Легко заметить, что данная функция легко "взламывается" при прочтении бинарного файла.
// - Также возможно извлечение информации о длине пароля при замера времени выполнения функции.
//==================================================================================================
bool password_is_ok(const char* check)
{
    // Последовательно сравниваем символы обеих строк
    const char* pswd = PASSWORD;
    for (; *pswd != '\0' && *check != '\0'; pswd++, check++)
    {
        if (*pswd != *check)
        {
            // При несовпадении любого символа строки не равны
            return false;
        }
    }

    // В противном случае строки равны при равенстве размеров
    return *pswd == *check;
}

//=========================================================//
// Опасная программа, некорректно производящая ввод строки //
//=========================================================//

int main(void)
{
    // Условие необходимости проверки пароля
    bool check_password = VERIFY_PASSWORD;
    char input_password[32U];

    // Считываем пароль от пользователя
    char* ret = gets(input_password);
    VERIFY_CONTRACT(ret != NULL, "ERROR: unable to input string\n");

    // Проверяем пароль и выполняем соответствующее действие
    if (!check_password || password_is_ok(input_password))
    {
        printf("Password is OK\n");
    }
    else
    {
        printf("Password is WRONG\n");
    }

    return EXIT_SUCCESS;
}
